#+TITLE:      Org Element API
#+AUTHOR:     Nicolas Goaziou
#+EMAIL:      mail@nicolasgoaziou.fr
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) NEW(n) Object(o) Element(e) GreaterElement(g) RecursiveObject(r)
#+LANGUAGE:   en
#+PRIORITIES: A C B
#+CATEGORY:   worg

=element.ss= implements a parser according to Org's syntax
specification.

The library contains tools to generate an abstract syntax tree (AST)
from an Org buffer, to analyze the syntactical object at point.
Parsing functions are detailed in the first part of the document,
along with their relative accessors and setters.

Upon parsing, each token in an Org document gets a type and some
properties attached to it.  This information can be extracted and
modified with provided accessors and setters.  An exhaustive list of
all tyes and attributes is given in section #attributes.

Eventually, the library is packed with a few useful functions,
described in the last section of the document.

** INPROGRESS Table                                          :GreaterElement:
   :PROPERTIES:
   :END:

   Greater element.

   - ~tblfm:~ :: Formulas associated to the table, if any (string or
                 nil).
   - ~type:~ :: Table's origin (symbol: ~table.el~, ~org~).
   - ~value:~ :: Raw ~table.el~ table or nil (string or nil).

Basically, this table becomes the following when parsed in full.

#+NAME: this is a table
  | N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
  |---+-----+-----+-----+---------+------------|
  | / |   < |     |   > |       < |          > |
  | 1 |   1 |   1 |   1 |       1 |          1 |
  | 2 |   4 |   8 |  16 |  1.4142 |     1.1892 |
  | 3 |   9 |  27 |  81 |  1.7321 |     1.3161 |
  |---+-----+-----+-----+---------+------------|
#+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))


#+begin_src emacs-lisp :results code
  ;; Emacs Lisp
  (set-buffer "element.org")
  (org-element-map (org-element-parse-buffer) '(table) 
    (lambda (tbl)
      (org-element-put-property tbl :parent '())
      (list (car tbl) (cadr tbl)))
    nil t)
#+end_src

#+begin_src emacs-lisp
(table
 (:begin 35374 :end 35798 :type org :tblfm
         ("$2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))")
         :contents-begin 35398 :contents-end 35727 :value nil :post-blank 2 :post-affiliated 35398 
         :name "this is a table" :parent nil))
#+end_src

#+begin_src gerbil :noweb-ref table-parser
  (def (table-parser (affiliated []) (granularity 'greater-element))
    ;; ~affiliated~ is a list of which ~car~ is the buffer position at the
    ;; beginning of the first affiliated keyword and ~cdr~ is a plist of
    ;; affiliated keywords along with their value.

    ;; If ~table-row~ is a parser, use that and return contents. This saves time
    ;; and effort for big tables when we actually want the lines.

    ;; A | followed by anything that is not WS marks a table line

    (def TABLE-ROW
       (if (eq? granularity 'greater-element)
         (.begin (skip WS) #\| (skip WS)
                 (sat (? (not char-whitespace?))) SKIP-LINE)
         (table-row-parser granularity)))

    (.let* ((b (if (not (null? affiliated)) (return (car affiliated)) (point)))
            (table-begin (point))
            (contents (many1 TABLE-ROW))
            (table-end (point))
            (tblfm (.or (many1 TBLFM) #f))
            (pos-before-blank (point))
            (blanks (many (.begin (many WS) #\newline)))
            (end (point))
            (afks (return (if (pair? affiliated) (cdr affiliated) []))))
      (let (el ['table (cons* begin: b end: end type: 'org tblfm: tblfm
                             contents-begin: table-begin contents-end: table-end
                             ;;; emacs tables get a value
                             value: #f
                             post-blank: (length blanks)
                             post-affiliated: table-begin
                             afks)])

         (begin0 (return el)
           (unless (eq? granularity 'greater-element)
             (set! (org-element-contents el) contents))))))
#+end_src



   |   |

   | asd | asd |
   |-----+-----|
   |     |     |


   


   
